{
  "intents": [
    {
      "tag": "Saludos",
      "patterns": [
        "Hola",
        "Buenos dias",
        "Como estas",
        "Hola",
        "Hay alguien ahi",
        "Hola, en que puedo ayudarte",
        "Hola, como estas",
        "Buenos dias, como amaneciste",
        "Buenas tardes, como te encuentras",
        "Buenas noches, que tal tu dia",
        "Que hay de nuevo",
        "Hola, que tal todo",
        "Como va todo por aqui",
        "Que cuentas de nuevo",
        "Como va la vida",
        "Hola, que hay de bueno",
        "Hola, como te va",
        "Que tal estas",
        "Hola, que tal tu dia",
        "Como estuvo tu fin de semana",
        "Buen dia, que tal",
        "Hola, como te sientes hoy",
        "Que tal tu jornada",
        "Como va todo por tu lado",
        "Hola, que cuentas",
        "Buenas tardes, que tal tu jornada",
        "Que hay de nuevo por aqui",
        "Hola, como estuvo tu noche",
        "Como amaneciste hoy",
        "Que hay de bueno por hoy",
        "Buenas noches, como te encuentras",
        "Hola, que tal tu semana",
        "Como te va en esta jornada",
        "Hola, como has estado",
        "Que tal tu dia hasta ahora",
        "Que cuentas de nuevo por hoy",
        "Buen dia, como amaneciste",
        "Hola, que tal tu manana",
        "Como te sientes hoy",
        "Buenas tardes, como has estado",
        "Como va todo por ahi",
        "Hola, que tal tu jornada",
        "Como amanecio hoy",
        "Que hay de bueno por hoy",
        "Buenas noches, como estas",
        "Hola, como te ha ido",
        "Que cuentas de nuevo por aqui",
        "Hola, que tal tu dia hasta ahora",
        "Buen dia, que tal tu jornada",
        "Como te ha ido en esta semana",
        "Hola, como amaneciste hoy",
        "Que hay de nuevo por tu lado",
        "Buenas tardes, como va todo",
        "Hola, como has estado ultimamente",
        "Que tal estas hoy",
        "Hola, como te encuentras hoy"
      ],
      "responses": [
        "Hola, en que puedo ayudarte",
        "Buenos dias, que necesitas",
        "Hola, como puedo asistirte hoy",
        "Hola, que puedo hacer por ti",
        "Hola, bienvenido a nuestra barberia, en que puedo ayudarte"
      ]
    },
    {
      "tag": "Despedida",
      "patterns": [
        "Adios",
        "Hasta luego",
        "Nos vemos",
        "Hasta luego",
        "Nos vemos mas tarde",
        "Que tengas un buen dia",
        "Adios por ahora",
        "Hasta pronto",
        "Nos vemos luego",
        "Que tengas un buen dia",
        "Hasta la proxima",
        "Cuidate",
        "Nos vemos pronto",
        "Hasta luego, amigo",
        "Nos vemos manana",
        "Que tengas una buena tarde",
        "Adios, que te vaya bien",
        "Que tengas un buen dia, colega",
        "Hasta la proxima vez",
        "Nos vemos despues",
        "Hasta manana",
        "Cuidate mucho",
        "Adios, amigo",
        "Que tengas una buena noche",
        "Nos vemos mas tarde, colega",
        "Hasta luego, companero",
        "Nos vemos por ahi",
        "Hasta pronto, companero",
        "Cuidate mucho, amigo",
        "Nos vemos en breve",
        "Adios por ahora, amigo",
        "Que tengas un buen descanso",
        "Hasta la proxima, amigo",
        "Nos vemos despues, colega",
        "Que pases una buena noche",
        "Adios, que te vaya bien, colega",
        "Hasta luego, que te vaya bien",
        "Nos vemos pronto, colega",
        "Cuidate mucho, companero",
        "Nos vemos mas tarde, amigo",
        "Hasta luego, que tengas un buen dia",
        "Adios por ahora, que te vaya bien",
        "Que tengas un buen descanso, colega",
        "Nos vemos en breve, amigo",
        "Hasta la proxima, que tengas un buen dia",
        "Que pases una buena noche, colega",
        "Adios, que tengas un buen dia",
        "Hasta luego, que tengas una buena tarde",
        "Nos vemos pronto, que te vaya bien",
        "Cuidate mucho, que tengas un buen dia",
        "Nos vemos mas tarde, que tengas un buen dia"
      ],
      "responses": [
        "Hasta luego, que tengas un buen dia",
        "Adios, espero verte de nuevo pronto",
        "Nos vemos, gracias por visitarnos"
      ]
    },
    {
      "tag": "Agradecimiento",
      "patterns": [
        "Gracias",
        "Muchas gracias",
        "Te agradezco",
        "Gracias por tu ayuda",
        "Te estoy muy agradecido",
        "Muchas gracias",
        "Que amable de tu parte",
        "Estoy muy agradecido por todo",
        "Te lo agradezco mucho",
        "No se como agradecerte",
        "Gracias por estar siempre ahi",
        "Eres increible",
        "No se que haria sin ti",
        "Te agradezco mucho por tu apoyo",
        "Mil gracias",
        "Estoy muy agradecido contigo",
        "Gracias por tu generosidad",
        "Te estoy eternamente agradecido",
        "Gracias por todo lo que haces",
        "Te lo agradezco de corazon",
        "Que gran ayuda has sido",
        "No tengo palabras para agradecerte",
        "Gracias por ser tan amable",
        "Eres un gran amigo",
        "Muchisimas gracias",
        "Estoy muy agradecido por tu bondad",
        "Te debo mucho",
        "Que gentil de tu parte",
        "Gracias por tu tiempo y esfuerzo",
        "Estoy tan agradecido",
        "No sabes cuanto significa para mi",
        "Gracias por todo tu apoyo incondicional",
        "Eres una persona maravillosa",
        "Que amabilidad la tuya",
        "Gracias por tu comprension",
        "Te lo agradezco mas de lo que puedo expresar",
        "Eres un angel",
        "No tengo palabras para agradecerte lo suficiente",
        "Gracias por hacer mi vida mejor",
        "Eres increiblemente generoso",
        "Te agradezco desde el fondo de mi corazon",
        "Que buen amigo eres",
        "No tengo como agradecerte lo suficiente",
        "Gracias por ser tan solidario",
        "Estoy tan agradecido de tenerte en mi vida",
        "Gracias por tu infinita paciencia",
        "Que amable eres conmigo",
        "Gracias por todo lo que has hecho por mi",
        "Te estoy muy agradecido por tu ayuda desinteresada",
        "No puedo agradecerte lo suficiente",
        "Eres un verdadero amigo",
        "Que gran corazon tienes"
      ],
      "responses": [
        "De nada, estoy aqui para ayudarte",
        "No hay problema",
        "Estoy feliz de ayudarte!"
      ]
    },
    {
      "tag": "Servicios",
      "patterns": [
        "Que servicios ofrecen",
        "Que tipos de corte hacen",
        "Cual es su especialidad",
        "Cuales son los servicios que ofrecen",
        "Que tipo de servicios proporcionan",
        "Puedes explicarme mas sobre sus servicios",
        "Cual es el alcance de sus servicios",
        "Que incluye el paquete de servicios",
        "Cual es la tarifa por sus servicios",
        "Ofrecen servicios personalizados",
        "Tienen servicios adicionales disponibles",
        "Cual es la duracion promedio de sus servicios",
        "Hay alguna promocion actual en sus servicios",
        "Cuales son los beneficios de sus servicios",
        "Cual es la politica de cancelacion de sus servicios",
        "Que garantias ofrecen con sus servicios",
        "Como puedo reservar sus servicios",
        "Cual es el procedimiento para solicitar sus servicios",
        "Como puedo pagar por sus servicios",
        "Que formas de pago aceptan para sus servicios",
        "Hay algun requisito previo para utilizar sus servicios",
        "Cual es el tiempo de respuesta para utilizar sus servicios",
        "Cual es el horario de atencion para sus servicios",
        "Tienen servicio de atencion al cliente",
        "Como puedo comunicarme con su equipo de servicios",
        "Ofrecen servicio de entrega a domicilio",
        "Puedo programar una cita para sus servicios",
        "Cual es el tiempo de espera para obtener sus servicios",
        "Que documentos necesito para utilizar sus servicios",
        "Tienen algun descuento por cliente frecuente",
        "Cual es la politica de reembolso de sus servicios",
        "Ofrecen servicios de instalacion",
        "Cual es la disponibilidad de sus servicios",
        "Cuanto tiempo llevan ofreciendo sus servicios",
        "Tienen servicio de asesoramiento personalizado",
        "Cual es la calidad de sus servicios",
        "Que opinan los clientes sobre sus servicios",
        "Puedo solicitar una demostracion de sus servicios",
        "Ofrecen servicios de mantenimiento",
        "Tienen opciones de servicios a medida",
        "Cual es el tiempo de respuesta para resolver problemas con sus servicios",
        "Tienen alguna politica de garantia de satisfaccion con sus servicios",
        "Cual es el nivel de experiencia del equipo que ofrece los servicios",
        "Como se diferencia su servicio de otros en el mercado",
        "Tienen algun programa de fidelizacion para clientes",
        "Ofrecen servicios de consultoria",
        "Cual es su politica de privacidad en relacion con los servicios",
        "Ofrecen servicios de soporte tecnico",
        "Tienen algun limite de disponibilidad para sus servicios",
        "Que incluye el contrato de servicios",
        "Cual es el plazo de validez de sus servicios"
      ],
      "responses": [
        "Ofrecemos cortes de pelo clasicos y modernos, afeitados y recortes de barba",
        "Nuestros servicios incluyen cortes de cabello, afeitados y cuidado de la barba"
      ]
    },
    {
      "tag": "Reservas",
      "patterns": [
        "Como puedo hacer una cita",
        "Estan aceptando citas",
        "Cual es su disponibilidad",
        "Tienen disponibilidad para una cita el proximo lunes",
        "Podria reservar una cita para esta semana",
        "Hay algun horario disponible para una cita manana por la manana",
        "Cual es la disponibilidad para una cita esta tarde",
        "Puedo hacer una reserva para una cita la proxima semana",
        "Hay alguna cita disponible para hoy",
        "Estan abiertos para citas los fines de semana",
        "Que horarios tienen disponibles para una cita",
        "Puedo reservar una cita para hoy mismo",
        "Cuando seria posible programar una cita",
        "Tienen alguna disponibilidad para citas durante las tardes",
        "Podria reservar una cita con anticipacion",
        "Cual es la disponibilidad para una cita urgente",
        "Tienen algun horario disponible para citas despues del trabajo",
        "Puedo hacer una reserva para una cita en linea",
        "Estan disponibles para citas durante los dias festivos",
        "Cual es el tiempo de espera para una cita",
        "Hay disponibilidad para una cita fuera del horario habitual",
        "Puedo programar una cita para mas tarde en la semana",
        "Cual es el proceso para reservar una cita",
        "Cual es la politica de cancelacion para las citas",
        "Puedo cambiar mi cita programada",
        "Tienen algun sistema de lista de espera para citas",
        "Hay disponibilidad para una cita de emergencia",
        "Estan aceptando nuevas reservas para citas",
        "Cual es el tiempo de espera promedio para una cita",
        "Puedo reservar una cita para mas de una persona",
        "Cual es la disponibilidad para citas durante el horario de almuerzo",
        "Puedo hacer una reserva para una cita por telefono",
        "Estan abiertos para citas durante todo el dia",
        "Cuanto tiempo dura una cita tipica",
        "Tienen algun horario especial para citas",
        "Cual es la politica de retraso para las citas",
        "Puedo reservar una cita para el mismo dia",
        "Tienen algun requisito previo para programar una cita",
        "Cual es el procedimiento para cancelar una cita",
        "Tienen disponibilidad para citas por la tarde",
        "Puedo hacer una reserva para una cita durante el horario de la siesta",
        "Estan disponibles para citas fuera del horario de atencion",
        "Cual es la disponibilidad para citas durante los dias laborables",
        "Hay algun costo adicional por reservar una cita fuera del horario normal",
        "Puedo hacer una reserva para una cita en persona",
        "Estan aceptando reservas anticipadas para citas",
        "Cual es la politica de reserva de citas para clientes habituales",
        "Puedo hacer una reserva para una cita en la sucursal mas cercana",
        "Estan aceptando reservas para citas en grupo",
        "Cual es el plazo de cancelacion para las citas",
        "Puedo reservar una cita para un servicio especifico",
        "Hay alguna restriccion de edad para hacer una reserva de cita"
      ],
      "responses": [
        "Por supuesto, puedes reservar una cita llamando a nuestro numero de telefono o visitandonos en persona"
      ]
    },
    {
      "tag": "Usuarios",
      "patterns": [
        "¿Cómo puedo registrar un nuevo usuario?",
        "¿Cómo inicio sesión en mi cuenta de usuario?",
        "¿Cómo puedo recuperar mi contraseña?",
        "¿Cómo puedo editar la información de mi perfil?",
        "¿Puedo eliminar mi cuenta de usuario?",
        "¿Cómo cambio mi contraseña de usuario?",
        "¿Hay algún requisito específico para registrarme como usuario?",
        "¿Qué información necesito proporcionar al registrar un usuario?",
        "¿Cómo puedo ver la lista de usuarios registrados en el sistema?",
        "¿Cuál es el proceso para actualizar mi información de usuario?",
        "¿Puedo tener múltiples roles de usuario en el sistema?",
        "¿Cómo puedo cambiar mi dirección de correo electrónico asociada a mi cuenta de usuario?",
        "¿Hay algún límite en la cantidad de usuarios que puedo registrar?",
        "¿Cómo puedo cambiar mi nombre de usuario en el sistema?",
        "¿Cuál es el proceso para cerrar sesión en mi cuenta de usuario?",
        "¿Puedo vincular mi cuenta de usuario a otras plataformas externas?",
        "¿Qué debo hacer si olvidé mi nombre de usuario?",
        "¿Cómo puedo solicitar ayuda si tengo problemas con mi cuenta de usuario?",
        "¿Qué medidas de seguridad se implementan para proteger la información del usuario?",
        "¿Hay alguna restricción de edad para registrarse como usuario en el sistema?"
      ],
      "responses": [
        "Puedes registrar un nuevo usuario desde la página de registro en nuestro sitio web.",
        "Para iniciar sesión, simplemente ve a la página de inicio de sesión e introduce tus credenciales.",
        "Si olvidaste tu contraseña, puedes restablecerla desde la página de recuperación de contraseña.",
        "Puedes editar la información de tu perfil en la sección de configuración de tu cuenta.",
        "Para eliminar tu cuenta de usuario, contáctanos para obtener ayuda.",
        "Para cambiar tu contraseña, ve a la sección de configuración de tu cuenta y sigue las instrucciones.",
        "Al registrarte, se te pedirá que proporciones información básica como nombre, correo electrónico, etc.",
        "La información requerida para registrar un usuario incluye nombre, dirección de correo electrónico, contraseña, etc.",
        "La lista de usuarios registrados está disponible para los administradores en el panel de administración.",
        "Puedes actualizar tu información de usuario desde la sección de configuración de tu cuenta.",
        "Sí, algunos usuarios pueden tener múltiples roles según sus permisos en el sistema.",
        "Para cambiar tu dirección de correo electrónico, ve a la sección de configuración de tu cuenta.",
        "El sistema puede tener un límite definido por el administrador en la cantidad de usuarios permitidos.",
        "Para cambiar tu nombre de usuario, ve a la sección de configuración de tu cuenta.",
        "Para cerrar sesión, simplemente haz clic en el botón 'Cerrar sesión' en la página principal.",
        "Actualmente no ofrecemos la opción de vincular cuentas de usuario a plataformas externas.",
        "Si olvidaste tu nombre de usuario, contáctanos para obtener ayuda.",
        "Si necesitas ayuda, contáctanos a través de nuestro servicio de soporte.",
        "Implementamos diversas medidas de seguridad para proteger la información del usuario, incluyendo cifrado de datos, autenticación de dos factores, etc.",
        "No hay restricciones de edad específicas, pero es posible que necesitemos cierta información adicional para usuarios menores de edad."
      ]
    },
    {
      "tag": "Ventas",
      "patterns": [
        "¿Cómo puedo crear una nueva venta en el sistema?",
        "¿Qué métodos de pago están disponibles para las ventas?",
        "¿Puedo ver el historial de mis ventas anteriores?",
        "¿Cómo puedo aplicar descuentos a una venta?",
        "¿Es posible cancelar una venta una vez realizada?",
        "¿Puedo generar informes de ventas para un período específico?",
        "¿Cómo puedo realizar un reembolso por una venta?",
        "¿Qué debo hacer si hay un problema con un producto vendido?",
        "¿Cuál es el proceso para gestionar el inventario después de una venta?",
        "¿Cómo puedo imprimir recibos o facturas para las ventas realizadas?",
        "¿Puedo configurar impuestos sobre las ventas en el sistema?",
        "¿Qué información se requiere para completar una venta?",
        "¿Cuál es el procedimiento para registrar una venta realizada en persona?",
        "¿Qué opciones de envío están disponibles para las ventas en línea?",
        "¿Cómo puedo verificar el estado de una venta pendiente?",
        "¿Hay alguna restricción en la cantidad de productos que puedo vender en una sola transacción?",
        "¿Es posible ofrecer opciones de financiamiento para las ventas?",
        "¿Cómo puedo gestionar las devoluciones de productos vendidos?",
        "¿Qué medidas de seguridad se implementan para proteger las transacciones de ventas?",
        "¿Puedo configurar notificaciones automáticas para las ventas realizadas?"
      ],
      "responses": [
        "Puedes crear una nueva venta desde la sección de ventas en el panel de control.",
        "Los métodos de pago disponibles incluyen tarjeta de crédito, PayPal, transferencia bancaria, etc.",
        "Sí, puedes ver el historial completo de tus ventas anteriores en la sección de ventas del sistema.",
        "Para aplicar descuentos a una venta, selecciona el producto y el descuento correspondiente durante el proceso de pago.",
        "La cancelación de una venta depende de las políticas de la empresa y puede requerir la aprobación del gerente.",
        "Sí, puedes generar informes detallados de ventas para un período específico desde la sección de informes.",
        "Para realizar un reembolso por una venta, ve a la sección de ventas y sigue las instrucciones para procesar el reembolso.",
        "Si hay un problema con un producto vendido, contáctanos para obtener asistencia y resolver el problema.",
        "Después de una venta, el sistema automáticamente actualiza el inventario para reflejar la cantidad vendida.",
        "Puedes imprimir recibos o facturas para las ventas desde la sección de ventas en el panel de control.",
        "Sí, puedes configurar impuestos sobre las ventas según las regulaciones fiscales locales.",
        "La información requerida para completar una venta incluye detalles del cliente, productos vendidos, método de pago, etc.",
        "Para registrar una venta realizada en persona, sigue el mismo proceso que para una venta en línea, pero selecciona 'Venta en persona' como método de pago.",
        "Las opciones de envío disponibles incluyen envío estándar, envío exprés, recogida en tienda, etc.",
        "Puedes verificar el estado de una venta pendiente en la sección de ventas del sistema.",
        "No hay restricciones específicas en la cantidad de productos que puedes vender, pero es posible que existan límites prácticos.",
        "Dependiendo de la política de la empresa, es posible ofrecer opciones de financiamiento para ciertas ventas.",
        "Para gestionar devoluciones, sigue el proceso de devolución establecido por la empresa y verifica la elegibilidad del producto para devolución.",
        "Implementamos medidas de seguridad como cifrado SSL para proteger las transacciones de ventas.",
        "Sí, puedes configurar notificaciones automáticas para recibir alertas sobre nuevas ventas realizadas."
      ]
    },
    {
      "tag": "Clientes",
      "patterns": [
        "¿Cómo puedo agregar un nuevo cliente al sistema?",
        "¿Puedo ver el historial de compras de un cliente?",
        "¿Cómo puedo editar la información de un cliente existente?",
        "¿Puedo importar una lista de clientes desde otro sistema?",
        "¿Qué información se requiere para registrar un nuevo cliente?",
        "¿Es posible categorizar a los clientes por tipo o segmento?",
        "¿Cómo puedo eliminar un cliente de la base de datos?",
        "¿Puedo asignar etiquetas o notas a los clientes para identificarlos mejor?",
        "¿Cuál es el procedimiento para buscar un cliente específico en la base de datos?",
        "¿Cómo puedo exportar la lista de clientes a un archivo CSV?",
        "¿Hay alguna restricción en la cantidad de clientes que puedo agregar?",
        "¿Qué opciones de contacto están disponibles para comunicarme con un cliente?",
        "¿Puedo enviar correos electrónicos masivos a todos los clientes registrados?",
        "¿Cuál es el proceso para agregar una nueva dirección de envío para un cliente?",
        "¿Es posible ver las estadísticas de actividad de un cliente en el sistema?",
        "¿Cómo puedo verificar la actividad reciente de un cliente en el sistema?",
        "¿Qué medidas de seguridad se implementan para proteger la información del cliente?",
        "¿Puedo configurar recordatorios para seguir el contacto con los clientes?",
        "¿Cuál es el tiempo de retención de datos para la información del cliente en el sistema?"
      ],
      "responses": [
        "Puedes agregar un nuevo cliente desde la sección de clientes en el panel de control.",
        "Sí, puedes ver el historial completo de compras de un cliente en su perfil.",
        "Para editar la información de un cliente existente, ve a su perfil y haz los cambios necesarios.",
        "Sí, puedes importar una lista de clientes desde un archivo CSV u otro sistema compatible.",
        "La información requerida para registrar un nuevo cliente incluye nombre, dirección de correo electrónico, teléfono, etc.",
        "Sí, puedes categorizar a los clientes según tus necesidades utilizando etiquetas o segmentos.",
        "Para eliminar un cliente, selecciona su perfil y sigue las instrucciones para eliminarlo de la base de datos.",
        "Sí, puedes asignar etiquetas o notas personalizadas a los clientes para identificarlos mejor.",
        "Puedes buscar un cliente específico utilizando el campo de búsqueda en la sección de clientes del sistema.",
        "Puedes exportar la lista de clientes a un archivo CSV desde la sección de clientes en el panel de control.",
        "No hay restricciones específicas en la cantidad de clientes que puedes agregar, pero es posible que existan límites prácticos.",
        "Las opciones de contacto pueden incluir correo electrónico, teléfono, mensajes internos, etc.",
        "Dependiendo de las regulaciones de privacidad, es posible enviar correos electrónicos masivos a los clientes con su consentimiento.",
        "Para agregar una nueva dirección de envío, ve al perfil del cliente y selecciona 'Agregar dirección'.",
        "Sí, puedes ver las estadísticas de actividad de un cliente en su perfil, incluyendo compras anteriores, interacciones, etc.",
        "Puedes verificar la actividad reciente de un cliente en su perfil o en la sección de actividad del sistema.",
        "Implementamos medidas de seguridad como cifrado SSL para proteger la información del cliente.",
        "Sí, puedes configurar recordatorios para seguir el contacto con los clientes y mantener la comunicación activa.",
        "El tiempo de retención de datos puede variar según las políticas de privacidad y las regulaciones locales."
      ]
    },
    {
      "tag": "Reservas",
      "patterns": [
        "¿Cómo puedo hacer una reserva?",
        "¿Están aceptando reservas en este momento?",
        "¿Cuál es la disponibilidad para reservas?",
        "¿Tienen disponibilidad para reservas el próximo lunes?",
        "¿Puedo reservar una cita para esta semana?",
        "¿Hay horarios disponibles para reservas mañana por la mañana?",
        "¿Cuál es la disponibilidad para reservas esta tarde?",
        "¿Puedo reservar una cita para la próxima semana?",
        "¿Hay alguna reserva disponible para hoy?",
        "¿Están abiertos para reservas los fines de semana?",
        "¿Qué horarios tienen disponibles para reservas?",
        "¿Puedo hacer una reserva para hoy mismo?",
        "¿Cuándo puedo programar una reserva?",
        "¿Tienen disponibilidad para reservas durante las tardes?",
        "¿Puedo reservar con anticipación?",
        "¿Cuál es la disponibilidad para reservas urgentes?",
        "¿Tienen horarios disponibles para reservas después del trabajo?",
        "¿Puedo hacer una reserva en línea?",
        "¿Están disponibles para reservas durante los días festivos?",
        "¿Cuál es el tiempo de espera para una reserva?",
        "¿Hay disponibilidad para reservas fuera del horario habitual?",
        "¿Puedo programar una reserva para más tarde en la semana?",
        "¿Cuál es el proceso para reservar?",
        "¿Cuál es la política de cancelación para las reservas?",
        "¿Puedo cambiar mi reserva programada?",
        "¿Tienen lista de espera para reservas?",
        "¿Hay disponibilidad para reservas de emergencia?",
        "¿Están aceptando nuevas reservas?",
        "¿Cuál es el tiempo de espera promedio para una reserva?",
        "¿Puedo reservar para más de una persona?",
        "¿Cuál es la disponibilidad para reservas durante el horario de almuerzo?",
        "¿Puedo hacer una reserva por teléfono?",
        "¿Están abiertos todo el día para reservas?",
        "¿Cuánto tiempo dura una reserva típica?",
        "¿Tienen horarios especiales para reservas?",
        "¿Cuál es la política de retraso para las reservas?",
        "¿Puedo reservar para el mismo día?",
        "¿Hay algún requisito previo para reservar?",
        "¿Cómo puedo cancelar una reserva?",
        "¿Tienen disponibilidad para reservas por la tarde?",
        "¿Puedo hacer una reserva durante la siesta?",
        "¿Están disponibles para reservas fuera del horario de atención?",
        "¿Cuál es la disponibilidad para reservas durante los días laborables?",
        "¿Hay algún costo adicional por reservas fuera del horario normal?",
        "¿Puedo hacer una reserva en persona?",
        "¿Están aceptando reservas anticipadas?",
        "¿Cuál es la política de reserva para clientes habituales?",
        "¿Puedo hacer una reserva en la sucursal más cercana?",
        "¿Están aceptando reservas para grupos?",
        "¿Cuál es el plazo de cancelación para las reservas?",
        "¿Puedo reservar para un servicio específico?",
        "¿Hay alguna restricción de edad para reservas?"
      ],
      "responses": [
        "Por supuesto, puedes hacer una reserva llamando a nuestro número de teléfono o visitándonos en persona."
      ]
    }
  ]
}
